/***********************************************************************************************//**

@file Rotation.cs
	
@author Keisuke Ohe
		
***************************************************************************************************/
		
using UnityEngine;
using System.Collections;


/***********************************************************************************************//**

常にオブジェクトを一定方向に回転させるスクリプト.
	
***************************************************************************************************/
public class Rotation : MonoBehaviour
{
	// --------------- inspector ---------------
	[SerializeField]
	Vector3 rotationSpd;


	void Update ()
	{
		this.transform.Rotate (this.rotationSpd * Time.deltaTime);
	}
}