using System;
using UnityEngine;


/***********************************************************************************************//**

タイマー.
	
***************************************************************************************************/
public class Timer
{
	public event Action Tick;				// Interval秒ごとに実行されるイベント
	public float Interval { get; set; }		// Tickイベントが何秒ごとに発生するか

	protected float t = 0;					// 経過時間のカウント


	/************************************************************************************//**
	コンストラクタ.
	****************************************************************************************/
	public Timer (float interval, Action func = null)
	{
		this.Interval = interval;
		this.Tick += func;
	}

	/************************************************************************************//**
	更新.
		
	@return なし		
	****************************************************************************************/
	public virtual void Update ()
	{
		this.t += Time.deltaTime;
		if (this.t > this.Interval)
		{
			this.ExecTick ();
			t = 0;
		}
	}

	/************************************************************************************//**
	Tickイベント実行. サブクラスから Tick イベントに登録された関数を呼び出すためにも使う.
		
	@return なし		
	****************************************************************************************/
	protected void ExecTick ()
	{
		if (this.Tick != null) this.Tick();
	}
}

