/***********************************************************************************************//**

@file BaseBeatObserver.cs
	
@author Keisuke Ohe
		
***************************************************************************************************/
		
using UnityEngine;


/***********************************************************************************************//**

MonoBehaviourを継承したビートオブザーバー.
	
***************************************************************************************************/
public abstract class BaseBeatBehaviour : MonoBehaviour, IBeatObserver
{
	protected SoundManager soundManager;


	/************************************************************************************//**
	コンストラクタ. Notifierと連結.
	****************************************************************************************/
	protected virtual void Start()
	{
		BeatNotifier.Attach (this);
		this.soundManager = GameObject.FindWithTag ("SoundManager").GetComponent<SoundManager> ();
	}
	
	/************************************************************************************//**
	デストラクタ. Notifierとの連結を解除.
	****************************************************************************************/
	protected virtual void OnDestroy()
	{
		BeatNotifier.Detach (this);
	}
	
	/************************************************************************************//**
	通知受け取り. ビートに合ったタイミングで呼ばれる.
		
	@return なし		
	****************************************************************************************/
	public abstract void Notice();
}
