/***********************************************************************************************//**

@file AutoDestroyBehindPlayer.cs
	
@author Keisuke Ohe
		
***************************************************************************************************/

using UnityEngine;
using System.Collections;


/***********************************************************************************************//**

プレイヤーの背後に行った場合に, オブジェクトを自動的に削除するスクリプト.

***************************************************************************************************/
public class AutoDestroyBehindPlayer : MonoBehaviour
{
	// --------------- inspector ---------------
	public float DeleteDistance = 10.0f;	// 削除を行う基準となる距離.

	// --------------- private ---------------
	Transform playerTransform;				// プレイヤーのTransform.


	/************************************************************************************//**
	開始.

	@return なし		
	****************************************************************************************/
	void Start ()
	{
		// プレイヤーのTransformの取得
		this.playerTransform = GameObject.FindWithTag ("Player").transform;
	}

	/************************************************************************************//**
	更新.
		
	@return なし		
	****************************************************************************************/
	void Update ()
	{
		// プレイヤーと壁とのZ軸上の距離を計算
		float distance = this.playerTransform.position.z - this.transform.position.z;

		// プレイヤーの背後に行っており, その距離が基準値を超えていた場合は, 削除する
		if (distance > this.DeleteDistance)
		{
			GameObject.Destroy (this.gameObject);
		}
	}
}
